/**
 * 用户权限
 */
var userPermission = {}
// 为单位用户设定默认的权限信息
userPermission.data = [
  {
    s: 'navi',
    n: '首页系统',
    m: [
      {
        id: '1',
        n: '首页',
        m: []
      }
    ]
  },
  {
    s: 'event',
    n: '事件分析',
    m: [
      {
        id: '1',
        n: '事件专题',
        m: [
          {
            id: '1',
            n: '事件概况研判',
            m: []
          },
          {
            id: '2',
            n: '信息汇总与综合查询',
            m: []
          },
          {
            id: '3',
            n: '统计分析',
            m: []
          },
          {
            id: '4',
            n: '参与群体推荐',
            m: []
          },
          {
            id: '5',
            n: '参与人员推荐',
            m: []
          },
          {
            id: '6',
            n: '行动性线索',
            m: []
          },
          {
            id: '7',
            n: '溯源分析',
            m: []
          },
          {
            id: '8',
            n: '扩线分析',
            m: []
          },
          {
            id: '9',
            n: '新群推荐',
            m: []
          },
          {
            id: '10',
            n: '专题档案',
            m: []
          }
        ]
      },
      {
        id: '4',
        n: '历史专题',
        m: [
          {
            id: '1',
            n: '事件概况研判',
            m: []
          },
          {
            id: '2',
            n: '信息汇总与综合查询',
            m: []
          },
          {
            id: '3',
            n: '统计分析',
            m: []
          },
          {
            id: '4',
            n: '参与群体推荐',
            m: []
          },
          {
            id: '5',
            n: '参与人员推荐',
            m: []
          },
          {
            id: '6',
            n: '行动性线索',
            m: []
          },
          {
            id: '7',
            n: '溯源分析',
            m: []
          },
          {
            id: '8',
            n: '扩线分析',
            m: []
          },
          {
            id: '10',
            n: '专题档案',
            m: []
          }
        ]
      },
      {
        id: '3',
        n: '专题配置',
        m: [
          {
            id: '1',
            n: '专题配置',
            m: []
          },
          {
            id: '2',
            n: '线索预警关键词配置',
            m: []
          },
          {
            id: '3',
            n: '事件类型配置',
            m: []
          },
          {
            id: '4',
            n: '事件数据管控',
            m: []
          }
        ]
      }
    ]
  },
  {
    s: 'monitor',
    n: '监测预警',
    m: [
      {
        id: '1',
        n: '信息查询',
        m: [
          {
            id: '1',
            n: '首页',
            m: []
          }
        ]
      },
      {
        id: '2',
        n: '预警详情',
        m: [
          {
            id: '1',
            n: '线索预警',
            m: []
          },
          {
            id: '2',
            n: '图片预警',
            m: []
          },
          {
            id: '3',
            n: '专题预警',
            m: []
          },
          {
            id: '4',
            n: '重点人预警',
            m: []
          },
          {
            id: '5',
            n: '关注账号预警',
            m: []
          }
        ]
      }
    ]
  },
  {
    s: 'dispose',
    n: '我的工作台',
    m: [
      {
        id: '1',
        n: '首页',
        m: [
          {
            id: '1',
            n: '首页',
            m: [
              {
                id: '1',
                n: '事件配置',
                m: []
              }
            ]
          }
        ]
      },
      {
        id: '2',
        n: '审批处置',
        m: [
          {
            id: '1',
            n: '首页',
            m: []
          }
        ]
      }
    ]
  },
  {
    s: 'people',
    n: '重点人分析',
    m: [
      {
        id: '1',
        n: '首页',
        m: [
          {
            id: '1',
            n: '首页',
            m: []
          }
        ]
      },
      {
        id: '2',
        n: '重点人列表',
        m: [
          {
            id: '1',
            n: '首页',
            m: []
          },
          {
            id: '2',
            n: '人物详情',
            m: []
          },
          {
            id: '3',
            n: '网上言论',
            m: []
          },
          {
            id: '4',
            n: '网络活动',
            m: []
          },
          {
            id: '5',
            n: '关系分析',
            m: []
          },
          {
            id: '6',
            n: '行为分析',
            m: []
          },
          {
            id: '7',
            n: '轨迹分析',
            m: []
          },
          {
            id: '8',
            n: '档案管理',
            m: []
          }
        ]
      },
      {
        'id': '3',
        'n': '配置管理',
        'm': [
          {
            'id': '1',
            'n': '批量导入',
            'm': []
          },
          {
            'id': '2',
            'n': '导入历史',
            'm': []
          },
          {
            'id': '3',
            'n': '标签配置',
            'm': []
          },
          {
            'id': '4',
            'n': '类别配置',
            'm': []
          }
        ]
      }
    ]
  },
  {
    s: 'manage',
    n: '系统管理',
    m: [
      {
        id: '1',
        n: '首页',
        m: []
      }
    ]
  },
  {
    s: 'data',
    n: '数据中心',
    m: [
      {
        id: '1',
        n: '首页',
        m: [
          {
            id: '1',
            n: '首页',
            m: []
          }
        ]
      },
      {
        id: '2',
        n: '一键搜',
        m: [
          {
            id: '1',
            n: '首页',
            m: []
          }
        ]
      },
      {
        id: '3',
        n: '人员分析',
        m: [
          {
            id: '1',
            n: '首页',
            m: []
          },
          {
            id: '2',
            n: '账号资料',
            m: []
          },
          {
            id: '3',
            n: '信息检索',
            m: []
          },
          {
            id: '4',
            n: '行为分析',
            m: []
          },
          {
            id: '5',
            n: '组织分析',
            m: []
          },
          {
            id: '6',
            n: '马甲分析',
            m: []
          },
          {
            id: '7',
            n: '地域分析',
            m: []
          }
        ]
      },
      {
        id: '4',
        n: '圈群分析',
        m: [
          {
            id: '1',
            n: '首页',
            m: []
          },
          {
            id: '2',
            n: '档案资料',
            m: []
          },
          {
            id: '3',
            n: '信息检索',
            m: []
          },
          {
            id: '4',
            n: '分析与研判',
            m: []
          },
          {
            id: '5',
            n: '热点云',
            m: []
          },
          {
            id: '6',
            n: '成员分析',
            m: []
          }
        ]
      },
      {
        id: '5',
        n: '扩线分析',
        m: [
          {
            id: '1',
            n: '首页',
            m: []
          },
          {
            id: '2',
            n: '扩线分析',
            m: []
          }
        ]
      },
      {
        id: '6',
        n: '溯源分析',
        m: [
          {
            id: '1',
            n: '首页',
            m: []
          },
          {
            id: '2',
            n: '溯源分析',
            m: []
          }
        ]
      },
      {
        id: '7',
        n: 'IP分析',
        m: [
          {
            id: '1',
            n: '首页',
            m: []
          }
        ]
      }
    ]
  }
]

userPermission.manage = [
  {
    s: 'manage',
    n: '管理系统',
    m: [
      {
        id: '1',
        n: '首页',
        m: []
      },
      {
        id: '2',
        n: '用户管理',
        m: []
      },
      {
        id: '3',
        n: '部门管理',
        m: []
      },
      {
        id: '4',
        n: '单位管理',
        m: []
      },
      {
        id: '7',
        n: 'ukey管理',
        m: []
      }
    ]
  }
]

userPermission.visitor = [
  {
    s: 'manage',
    n: '管理系统',
    m: [
      {
        id: '1',
        n: '首页',
        m: []
      },
      {
        id: '5',
        n: '系统登录轨迹',
        m: []
      },
      {
        id: '6',
        n: '用户行为跟踪',
        m: []
      }
    ]
  }
]
